fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаДокумента/Module.bsl
// @strict-types

&НаКлиенте
Процедура ОтпускаСотрудниковПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)

	Если Элемент <> Неопределено И Элемент.ТекущиеДанные <> Неопределено Тогда
		
	ДатаНачала = НачалоДня(Элемент.ТекущиеДанные.ДатаНачала);
	ДатаОкончания = КонецДня(Элемент.ТекущиеДанные.ДатаОкончания);

	Если (ДатаОкончания - ДатаНачала) / 86400 > 28 Тогда
		Элемент.ТекущиеДанные.Более28 = Истина;
	Иначе
		Элемент.ТекущиеДанные.Более28 = Ложь;
	КонецЕсли;
	
КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура АнализГрафика(Команда)

	ПараметрыОткрытия = Новый Структура("ОтпускаСотрудниковОбъект", Объект.ОтпускаСотрудников);

	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.ФормаАнализаГрафиков", ПараметрыОткрытия, ЭтотОбъект);

КонецПроцедуры
